# MAT281 - Laboratorio N°04

<a id='p1'></a>

## Problema 01

En la carpeta data se encuentra el archivo `nba.db`, el cual muestra informacion básica de algunos jugadores de la NBA.

<img src="https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQHCVR_4gPOmYYGglSV0rT1WlJtgRGnIw6Z6G68PTY1r_Qunv-6C3BDIa3jnStoNvdgcEE&usqp=CAU" align="center"/>

In [2]:
from sqlalchemy import create_engine
import pandas as pd
import os  

# Crear conector
conn = create_engine(os.path.join('sqlite:///', 'nba.db'))

In [3]:
# funcion de consultas
def consulta(query,conn):
    return pd.read_sql_query(query, con=conn)

In [4]:
# ejemplo
query = """
SELECT * FROM player
"""
consulta(query,conn)

                     name  ...                                college
0          Alaa Abdelnaby  ...                        Duke University
1         Zaid Abdul-Aziz  ...                  Iowa State University
2     Kareem Abdul-Jabbar  ...  University of California, Los Angeles
3      Mahmoud Abdul-Rauf  ...             Louisiana State University
4       Tariq Abdul-Wahad  ...              San Jose State University
...                   ...  ...                                    ...
4545           Ante Zizic  ...                                   None
4546             Jim Zoet  ...                  Kent State University
4547            Bill Zopf  ...                    Duquesne University
4548          Ivica Zubac  ...                                   None
4549           Matt Zunic  ...           George Washington University

[4550 rows x 8 columns]

El objetivo es tratar de obtener la mayor información posible de este conjunto de datos mediante código **SQL**. Para cumplir con este objetivo debe resolver las siguientes problemáticas:

1. Mostrar las primeras 5 filas

In [9]:
# operador LIMIT
query = """
SELECT * FROM player LIMIT 5;
"""
consulta(query,conn)

                  name  ...                                college
0       Alaa Abdelnaby  ...                        Duke University
1      Zaid Abdul-Aziz  ...                  Iowa State University
2  Kareem Abdul-Jabbar  ...  University of California, Los Angeles
3   Mahmoud Abdul-Rauf  ...             Louisiana State University
4    Tariq Abdul-Wahad  ...              San Jose State University

[5 rows x 8 columns]

2. Seleccionar los valores únicos de la columna `position`.

In [11]:
#operador 
query = """
SELECT DISTINCT position FROM player;
"""
consulta(query,conn)

  position
0      F-C
1      C-F
2        C
3        G
4        F
5      G-F
6      F-G
7     None

3. Seleccionar y cambiar el nombre de la columna `name` por `nombre`

In [15]:
#operador 
query = """
SELECT name AS nombre FROM player;
"""
consulta(query,conn)

                   nombre
0          Alaa Abdelnaby
1         Zaid Abdul-Aziz
2     Kareem Abdul-Jabbar
3      Mahmoud Abdul-Rauf
4       Tariq Abdul-Wahad
...                   ...
4545           Ante Zizic
4546             Jim Zoet
4547            Bill Zopf
4548          Ivica Zubac
4549           Matt Zunic

[4550 rows x 1 columns]

4. Determinar el tiempo (en años) de cada jugador en su posición

In [18]:
#operador 
query = """
SELECT year_start, year_end,
year_end - year_start as tiempo
FROM player;
"""
consulta(query,conn)

      year_start  year_end  tiempo
0           1991      1995       4
1           1969      1978       9
2           1970      1989      19
3           1991      2001      10
4           1998      2003       5
...          ...       ...     ...
4545        2018      2018       0
4546        1983      1983       0
4547        1971      1971       0
4548        2017      2018       1
4549        1949      1949       0

[4550 rows x 3 columns]

5. Encontrar el valor máximo de la columna `weight` por cada  valor de la columna `position`

In [42]:
#operador 
query = """
SELECT position, MAX(weight),
MAX(weight) as max
FROM player;
"""
consulta(query,conn)

  position  MAX(weight)    max
0        C        360.0  360.0

6. Encontrar el total de jugadores por cada valor de la columna `year_start`

7. Encontrar el valor mínimo, máximo y promedio de la columna `weight` por cada valor de la columnas `college`

8. Filtrar por aquellos jugadores que cumplan con :
* Para la columna `year_start` tienen un valor mayor 1990 y menor a 2000
* Para la columna `position` tienen un valor de `C`,`C-F` o `F-C`
* Para la columna `college` tienen un valor distinto de `Duke University`

9. Crear dos conjuntos de datos y juntarlos en una misma *query*. Las condiciones de cada uno de los cojunto de datos son:

* **df1**:
    * Para la columna `year_start` tienen un valor mayor 1990 y menor a 2000
    * Para la columna `position` tienen un valor de `C`,`C-F` o `F-C`
   
* **df2**:
    * Para la columna `year_end` tienen un valor menor a 2000
    * Para la columna `position` tienen un valor de `G`o `F`